BibleBraille/src/BibleBrailleWSDL.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="BibleBrailleWSDL" targetNamespace="http://j2ee.netbeans.org/wsdl/BibleBraille/src/BibleBrailleWSDL"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/BibleBraille/src/BibleBrailleWSDL" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types/>
    <message name="getVerseRequest">
        <part name="book" type="xsd:string"/>
        <part name="chapter" type="xsd:int"/>
        <part name="verse" type="xsd:int"/>
    </message>
    <message name="getVerseResponse">
        <part name="braille" type="xsd:base64Binary"/>
        <part name="audio" type="xsd:string"/>
        <part name="text" type="xsd:string"/>
    </message>
    <message name="getVerseFault">
        <part name="error" type="xsd:string"/>
    </message>
    <portType name="BibleBrailleWSDLPortType">
        <operation name="getVerse">
            <input name="input1" message="tns:getVerseRequest"/>
            <output name="output1" message="tns:getVerseResponse"/>
            <fault name="fault1" message="tns:getVerseFault"/>
        </operation>
    </portType>
    <binding name="BibleBrailleWSDLBinding" type="tns:BibleBrailleWSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="getVerse">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/BibleBraille/src/BibleBrailleWSDL"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/BibleBraille/src/BibleBrailleWSDL"/>
            </output>
            <fault name="fault1">
                <soap:fault name="fault1" use="literal" namespace="http://j2ee.netbeans.org/wsdl/BibleBraille/src/BibleBrailleWSDL"/>
            </fault>
        </operation>
    </binding>
    <service name="BibleBrailleWSDLService">
        <port name="BibleBrailleWSDLPort" binding="tns:BibleBrailleWSDLBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/BibleBrailleWSDLService/BibleBrailleWSDLPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="BibleBrailleWSDL">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="BibleBrailleWSDLPortTypeRole" portType="tns:BibleBrailleWSDLPortType"/>
    </plnk:partnerLinkType>
</definitions>
